{"id":2025,"parentExerciseId":2025,"name":"Counters","slug":"loops-101__Counters/introduction","sequenceNum":3000,"reviewType":"peer","solution":null,"content":"```ngMeta\nname: Counters\n```\n\n# What are Counters?\n\nWhile loops mein counter ka ek bahot important concept hota hai. Loops ko hum ek hi kaam ko baar baar karane mein use karte hain. Lekin hum uss kaam ko ek particular time tak hi karana hota hai.\n\nJaise agar humein 1 se 100 tak numbers print karane hain toh humein toh humein yeh ginti rakhni padegi ki humne kahan tak print kara hai. Isse humein yeh pata chalega ki habhi kitna print karna hai. Loops mein hum counters ka use kar ke yeh ginti rakhte hain.\n\n@[youtube](counter-video-id-here)\n\n## Structure of the Video\n\n1. Take an example of how maintaining a count of things is important. Imagine you have 10,000 balls and you have to transfer 100 to another room. How will you maintain a count? You can keep a track of the number of balls you have transferred till now.\n2. Similarly in terms of loops we always need to keep a track of how many times a task needs to be done. In terms of the balls we would see that until the number of balls in the other room gets 100 we will keep on shifting one ball. Write a code for this.\n3. Basically counter is helping us keep a track of how many times a loop is run. Two things in combination help us keep a track. The counter and how does the changing of the counter helps us keep a track of how many times a loop needs to run.\n4. Let's say we need to print numbers from 1 to 10. Now how can we do it? We will take i as 1 and write the following code:\n```python\ni = 0.1\nwhile i <=1:\n  print(\"Hello\")\n  i = i + 0.1\n```\nTake the notion of a number line basically going from 1 to 10. Basically how many steps does it take to go from 1 to 10. 10 steps. Similarly if the take 0.1 and do a step of 0.1 how does it make a difference? It is doing the same thing. Our loop would still run as many times.\n5. How about when we want to print all the even numbers between 1 and 10 and we need to include both the numbers. There are two ways to do this:\n```python\n# method 1\ni = 1\nwhile i <= 10:\n  if i % 2 == 0:\n    print(i)\n  i = i + 1\n\n# method 2\ni = 2\nwhile i <= 10:\n  print(i)\n  i = i + 2\n```\n6. Let's say we need to write a loop to take an input of some numbers from the user 10 times and then take a sum. There are multiple ways to write this loop and every loop works in a similar way.\n```python\n# method 1\ni = 10\nsum = 0\nwhile i >= 1:\n  x = input(\"Enter the number> \")\n  x = int(x)\n  sum = sum + x\n  i = i - 1\n\n# method 2\ni = 1\nsum = 0\nwhile i <= 10:\n  x = input(\"Enter the number> \")\n  x = int(x)\n  sum = sum + x\n  i = i + 1\n\n# method 3\ni = 651\nsum = 0\nwhile i <= 660:\n  x = input(\"Enter the number> \")\n  x = int(x)\n  sum = sum + x\n  i = i + 1\n```\n7. Go through and do some examples which are given for you in the next set of examples.\n","submissionType":null,"githubLink":"https://github.com/navgurukul/newton/tree/master/loops-101/Counters/introduction.md"}