{"id":2146,"parentExerciseId":null,"name":"Navgurukul Introduction","slug":"maths-hi-toh-hai__Navgurukul-Introduction","sequenceNum":1000,"reviewType":"peer","solution":null,"content":"#                             ***welcome to Navgurukul study guide***\n###  This study guide will help you to prepare for navgurukul written test and logical interview.\n### Yah jo page hain aap log ko navgurukul likhit test or logical interview ke liye hain:\n\n### Here's the blurb for selection process\n### Yahaan selection process ke lie upalabdh hai\n### Navgurukul selection process includes the following steps:\n### Navagurukul selection process mein nimnalikhit selection shaamil hain:\n\n1.\tAn hour long, written/online entrance test to evaluate your logical ability.\n\n      apane Logical ability ka moolyaankan(Evaluation) karane ke lie ek ghante lamba, likhit/onalain pravesh pareeksha.\n\n2.\tA short test in English to understand whether you are comfortable with a basic level of English.\n\n      english mein ek chhota test yah samajhane ke lie ki kya aap english ke Basic Level ke saath sahaj(Spontaneous) hain.\n\n3.\tAn elaborate test on your logical ability in a telephonic interview to understand how prepared you are to start learning software        programming.\n\n      Software prograaming seekhana shuroo karane ke lie aap kitane taiyaar hain, yah samajhane ke lie ek teleephonik interview mein           aapaki Logical kshamata(ability) par Detailed test.\n\n\n4.\tImmediately following your logical interview, a conversation about your personal journey so far and where you wish to go from here,      to understand whether Navgurukul community could be relevant and appropriate for you.\n\n      aapake Logical interview ke turant baad, aapaki Personal yaatra ke baare mein ek baatacheet aur jahaan aap yahaan se jaane kee           ichchha rakhate hain, yah samajhane ke lie ki kya navagurukul samudaay aapake lie praasangik or upayukt ho sakata hai.\n \n\nUpon successful completion of all the above steps, we will inform your on your selection, help you discuss with your family members and have you onboarded. And through the entire process, all of us at Navgurukul will support you in all possible ways. So be relaxed, work hard and ask for help whenever you need.\n\nuparokt sabhee charanon ke saphal(Successful) samaapan par, ham aapake selection par aapako soochit karenge, aapake parivaar ke sadasyon ke saath charcha karane mein aapakee madad karenge. aur pooree prakriya ke maadhyam se, navagurukul mein ham sabhee aapako har sambhav tareeke se samarthan karenge. isalie tanaavamukt(stress free) rahen, hard mehanat karen aur jab bhee jaroorat ho madad maange.\n\n\n### How to use this guide:\n### Is guide ka upayog kaise karen:\n\nRight side of this page you con see enroll in course below that pattern questions, percentage questions, linear questions, unitary questions, so first click on pattern questions in that some questions are sorted already you can watch videos also to understand in a better way and practise more questions related to it so practise more as like the previous process learn and practise parcentage questions, linear questions, unitary questions to be prepare for the logical interview test.\n\nIs Page ke right or jo aap dekhate hain, usake neeche naamaankan ko dekhen pattern questions, percentage questions, linear questions, unitary questions, isalie sabase pahale pattern questions par klik karen jisamen kuchh questions pahale se hee kie gae hain, or aap video ko behatar tarike se samajhane ke lie bhee dekh sakate hain aur isase sambandhit adhik question ka abhyaas kar sakate hain taaki pichhale prakriya kee tarah adhik abhyaas karen aur parcentage questions, linear questions, unitary questions seekhen. Logical interview test kee taiyaaree karana.\n\n### Tests for Navgurukul:\n### Navgurukul ke li test:\n\n### Tips: \n\n1. Don't scare to math.\n   Math se daren nahi.\n  \n2. Do logical question.\n   Logical questions karen.\n   \n3. Just practise these question and you will be ready for interview.\n   Bas in question ka abhyaas karen aur aap interview ke lie taiyaar ho jaenge.\n","submissionType":null,"githubLink":"https://github.com/navgurukul/newton/tree/master/maths-hi-toh-hai/Navgurukul-Introduction.md"}